app/controllers/api/notes_controller.rb

INSERT INTO "notebooks" ("author_id", "title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["author_id", 1], ["title", "Star Wars"], ["created_at", 2017-04-21 12:48:08 UTC], ["updated_at", 2017-04-21 12:48:08 UTC]]
INSERT INTO "notes" ("title", "body", "notebook_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @note = Note.new(note_params)

    if params[:notebook_id]
      @note.notebook_id = params[:notebook_id]
    else
      @note.notebook_id = current_user.notebooks.find_by_defaultNotebook(true).id
    end

    if @note.save

UPDATE "notes" SET "title" = $1, "updated_at" = $2 WHERE "notes"."id" = $3  [["title", "REVISION"], ["updated_at", 2017-04-25 04:46:44 UTC], ["id", 91]]
---
  def update
    @note = current_user.notes.find(params[:id])

    if @note.update(note_params)

DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 56]]
---
  def destroy
    @note = current_user.notes.find(params[:id])

    if @note.destroy