app/views/api/notebooks/index.json.jbuilder

@notebooks.each do |notebook|
  note_count = notebook.notes.length
---
SELECT "notes".* FROM "notes" WHERE "notes"."notebook_id" = $1  [["notebook_id", 17]]